In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [6]:
# copy DataFrame into new variable, df2
df2 = df.copy()

In [7]:
df

        one       two     three
a  0.916074  1.521800       NaN
b  0.687360 -1.890669 -3.817769
c  0.687017 -0.561577  0.575597
d       NaN -0.633644 -1.523346

In [8]:
df2

        one       two     three
a  0.916074  1.521800       NaN
b  0.687360 -1.890669 -3.817769
c  0.687017 -0.561577  0.575597
d       NaN -0.633644 -1.523346

## Boolean Comparisons

In [4]:
# Greater than
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [13]:
# Not Equal (note that NaNs are not equal to each other)
# In other words, 'np.nan==np.nan' returns 'False'
df2.ne(df)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [14]:
# Less Than
df2.lt(df)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [15]:
# Less Than or Equal To
df2.le(df)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [16]:
# Greate Than or Equal To
df2.ge(df)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

## Reductions

These functions evaluates each column in its entirety based on the expression being called. The output is a column of the columns evaluated and another column of the outputs associated. Thus, a reduction.

In [17]:
(df > 0).all()

one      False
two      False
three    False
dtype: bool

In [18]:
(df > 0).any()

one      True
two      True
three    True
dtype: bool

In [19]:
(df > 0).any().any()

True

## Evaluating single elements using `.bool()`

In [20]:
pd.Series([True]).bool()

True

In [21]:
pd.Series([False]).bool()

False

In [23]:
pd.DataFrame([[True]]).bool()

True

In [24]:
pd.DataFrame([[False]]).bool()

False

# Objects Comparison